1c-configuration-manager/src/DataProcessors/ФормированиеЗадачНаРучнуюОбработку/ФормированиеЗадачНаРучнуюОбработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеЗадачНаРучнуюОбработку</name>
</mdclass:DataProcessor>

1c-configuration-manager/src/InformationRegisters/СравнениеКонфигураций/СравнениеКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СравнениеКонфигураций</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТипИзменений</name>
    <type>
      <types>EnumRef.ТипыИзменений</types>
    </type>
  </resources>
  <resources>
    <name>ОтНачалаФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтНачалаФункции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПредыдущейФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтОкончанияФункции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВероятностьУспеха</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Проблема</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЯкорьПеред</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЯкорьПосле</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МодульБазовойКонфигурации</name>
    <type>
      <types>CatalogRef.СвойстваОбъектаКонфигурации</types>
    </type>
  </resources>
  <resources>
    <name>МодульИзмененнойКонфигурации</name>
    <type>
      <types>CatalogRef.СвойстваОбъектаКонфигурации</types>
    </type>
  </resources>
  <resources>
    <name>ТипПроблемы</name>
    <type>
      <types>EnumRef.ТипыПроблем</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбработки</types>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииОбработкиДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c-configuration-manager/src/InformationRegisters/ОбработанныеОбъектыКонфигурации/ОбработанныеОбъектыКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбработанныеОбъектыКонфигурации</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбработки</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.Приоритеты</types>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииОбработкиДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>CatalogRef.ОбъектыКонфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвойствоОбъектаКонфигурации</name>
    <type>
      <types>CatalogRef.СвойстваОбъектаКонфигурации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c-configuration-manager/src/Enums/СтатусыОбработки/СтатусыОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбработки</name>
  <enumValues>
    <name>ТребуетсяОбработка</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Частично</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
</mdclass:Enum>

1c-configuration-manager/src/Enums/Приоритеты/Приоритеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Приоритеты</name>
  <enumValues>
    <name>Блокирующий</name>
  </enumValues>
  <enumValues>
    <name>Критический</name>
  </enumValues>
  <enumValues>
    <name>Высокий</name>
  </enumValues>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>ВПоследнююОчередь</name>
  </enumValues>
</mdclass:Enum>

1c-configuration-manager/src/DataProcessors/ФормированиеЗадачНаРучнуюОбработку/Forms/ФормаПереназначитьЗадачиПоТекстовомуСпискуКлючей/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сценарий = Параметры.Сценарий;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура Преобразовать(Команда)
	ПреобразоватьНаСервере();    
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТаблица;
КонецПроцедуры

&НаСервере
Процедура ПреобразоватьНаСервере()
	
	МассивКлючей = СтрРазделить(Текст,Символы.ПС,Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сравнение.Сценарий КАК Сценарий,
	|	Сравнение.Ключ КАК Ключ,
	|	Сравнение.МодульБазовойКонфигурации.ОбъектКонфигурации.Конфигурация КАК Конфигурация,
	|	Сравнение.МодульБазовойКонфигурации.ОбъектКонфигурации КАК ОбъектКонфигурации,
	|	Сравнение.МодульБазовойКонфигурации КАК СвойствоОбъектаКонфигурации
	|ПОМЕСТИТЬ ВтКлючи
	|ИЗ
	|	РегистрСведений.СравнениеКонфигураций КАК Сравнение
	|ГДЕ
	|	Сравнение.Сценарий = &Сценарий
	|	И Сравнение.Ключ В(&МассивКлючей)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтКлючи.Сценарий КАК Сценарий,
	|	ВтКлючи.Ключ КАК Ключ,
	|	ВтКлючи.Конфигурация КАК Конфигурация,
	|	ВтКлючи.ОбъектКонфигурации КАК ОбъектКонфигурации,
	|	ВтКлючи.СвойствоОбъектаКонфигурации КАК СвойствоОбъектаКонфигурации,
	|	ЕСТЬNULL(ОбработанныеОбъектыКонфигурации.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыОбработки.ТребуетсяОбработка)) КАК Статус,
	|	ЕСТЬNULL(ОбработанныеОбъектыКонфигурации.Ответственный, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Ответственный,
	|	ЕСТЬNULL(ОбработанныеОбъектыКонфигурации.Комментарий, """") КАК Комментарий,
	|	ЕСТЬNULL(ОбработанныеОбъектыКонфигурации.Дата, НЕОПРЕДЕЛЕНО) КАК Дата,
	|	ЕСТЬNULL(ОбработанныеОбъектыКонфигурации.Приоритет, ЗНАЧЕНИЕ(Перечисление.Приоритеты.Основной)) КАК Приоритет
	|ИЗ
	|	ВтКлючи КАК ВтКлючи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбработанныеОбъектыКонфигурации КАК ОбработанныеОбъектыКонфигурации
	|		ПО ВтКлючи.Сценарий = ОбработанныеОбъектыКонфигурации.Сценарий
	|			И ВтКлючи.Конфигурация = ОбработанныеОбъектыКонфигурации.Конфигурация
	|			И ВтКлючи.ОбъектКонфигурации = ОбработанныеОбъектыКонфигурации.ОбъектКонфигурации
	|			И ВтКлючи.СвойствоОбъектаКонфигурации = ОбработанныеОбъектыКонфигурации.СвойствоОбъектаКонфигурации";
	Запрос.УстановитьПараметр("МассивКлючей",МассивКлючей);
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаПланируемыхЗадач.Очистить();
	
	Пока Выборка.Следующий() Цикл      
		стр_н = ТаблицаПланируемыхЗадач.Добавить();
		ЗаполнитьЗначенияСвойств(стр_н,Выборка);  
		
		// проставим Сценарий если не заполнено
		Если НЕ ЗначениеЗаполнено(стр_н.Сценарий) Тогда
			стр_н.Сценарий = Сценарий;
		КонецЕсли;		
		
		// проставим статус если не заполнено
		Если НЕ ЗначениеЗаполнено(стр_н.Статус) Тогда
			стр_н.Статус = Перечисления.СтатусыОбработки.ТребуетсяОбработка;
		КонецЕсли;

		// проставим статус если не заполнено
		Если НЕ ЗначениеЗаполнено(стр_н.Приоритет) Тогда
			стр_н.Приоритет = Перечисления.Приоритеты.Основной;
		КонецЕсли;

		// проставим статус если не заполнено
		Если НЕ ЗначениеЗаполнено(стр_н.Дата) Тогда
			стр_н.Дата = ТекущаяДата();
		КонецЕсли;
		
		стр_н.Ответственный = Ответственный;
		
	КонецЦикла;	
	
КонецПроцедуры


&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура СохранитьНаСервере()              
	
	Для каждого стр из ТаблицаПланируемыхЗадач Цикл
		
		МенеджерЗаписи = РегистрыСведений.ОбработанныеОбъектыКонфигурации.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,стр);
		МенеджерЗаписи.Записать(Истина);
		
	КонецЦикла;

КонецПроцедуры
